RT-Thread/rt-thread/bsp/m16c62p/drivers/iom16c62p.h
/****************************************************************
KPIT Cummins Infosystems Ltd, Pune, India. 1-April-2006.

This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.

*****************************************************************/
/****************************************************************/
/*      M16C/60 62P Include File                                */
/****************************************************************/


/*------------------------------------------------------
    Processor mode register 0  //0x0004
------------------------------------------------------*/
union st_pm0 {               /* union PM0                               */
  struct {                      /* Bit  Access                            */
     unsigned char     PM0_0:1; /* Processor mode bit 0                 */
     unsigned char     PM0_1:1; /* Processor mode bit 1                 */
     unsigned char     PM0_2:1; /* R/W mode select bit                  */
     unsigned char     PM0_3:1; /* Software reset bit                    */
     unsigned char     PM0_4:1; /* Multiplexed bus space select bit 0    */
     unsigned char     PM0_5:1; /* Multiplexed bus space select bit 1    */
     unsigned char     PM0_6:1; /* Port P40 to P43 function select bit */
     unsigned char     PM0_7:1; /* BCLK output disable bit                  */
  } BIT;                         /*                                        */
    unsigned  char BYTE;     /*  Byte Access                         */
};                           /*                                     */

/*------------------------------------------------------
    Processor mode register 1  //0x0005
------------------------------------------------------*/
union st_pm1 {              /* union PM1                                */
  struct {                    /* Bit  Access                                 */
     unsigned char PM1_0:1; /* CS2 area switching bit                */
     unsigned char PM1_1:1; /* Port P3_4 to P3_7 function select bit */
     unsigned char PM1_2:1; /* Watch dog timer function select bit   */
     unsigned char PM1_3:1; /* Intermal reserved area expansion bit  */
     unsigned char PM1_4:1; /* Memory area expansion bit             */
     unsigned char PM1_5:1; /* Memory area expansion bit             */
     unsigned char PM1_6:1; /* Reserved bit                           */
     unsigned char PM1_7:1; /* PM17 - Wait bit                         */
  } BIT;                       /*                                         */
     unsigned char BYTE;    /*  Byte Access                          */
};                          /*                                          */

/*------------------------------------------------------
    System clock control register 0  //0x0006
------------------------------------------------------*/
union st_cm0 {               /* union CM0                               */
  struct {                      /* Bit  Access                            */
     unsigned char     CM0_0:1; /* Clock output function select bit     */
     unsigned char     CM0_1:1; /* Clock output function select bit     */
     unsigned char     CM0_2:1; /* WAIT peripheral function clock stop bit */
     unsigned char     CM0_3:1; /* Xcin-Xcout drive capacity select bit*/
     unsigned char     CM0_4:1; /* Port Xc select bit                     */
     unsigned char     CM0_5:1; /* Main clock stop bit                    */
     unsigned char     CM0_6:1; /* Main clock division select bit 0     */
     unsigned char     CM0_7:1; /* System clock select bit             */
  } BIT;                         /*                                        */
    unsigned char BYTE;      /*  Byte Access                         */
};                           /* system clock control register  0    */


/*------------------------------------------------------
    System clock control register 1 //0x0007
------------------------------------------------------*/
union st_cm1 {               /* union CM1                               */
  struct {                      /* Bit  Access                            */
     unsigned char     CM1_0:1; /* All clock stop control bit             */
     unsigned char          :1; /* Reserved bit always set to 0        */
     unsigned char           :1; /* Reserved bit always set to 0        */
     unsigned char          :1; /* Reserved bit always set to 0        */
     unsigned char          :1; /* Reserved bit always set to 0        */
     unsigned char     CM1_5:1; /* Xin-Xouts drive capacity select bit */
     unsigned char     CM1_6:1; /* Main clock division select bit 1     */
     unsigned char     CM1_7:1; /* Main clock division select bit 1     */
  } BIT;                         /*                                        */
    unsigned char BYTE;      /*  Byte Access                         */
};                           /* system clock control register 1     */


/*------------------------------------------------------
    Chip select control register //0x0008
------------------------------------------------------*/
union st_csr {               /* union CSR                               */
   struct {                  /* Bit  Access                            */
     unsigned char    CS0 :1;  /* CS0~ output enable bit                */
     unsigned char    CS1 :1;  /* CS1~ output enable bit                 */
     unsigned char    CS2 :1;  /* CS2~ output enable bit                 */
     unsigned char    CS3 :1;  /* CS3~ output enable bit                 */
     unsigned char    CS0W:1;  /* CS0~ wait bit                         */
     unsigned char    CS1W:1;  /* CS1~ wait bit                         */
     unsigned char    CS2W:1;  /* CS2~ wait bit                         */
     unsigned char    CS3W:1;  /* CS3~ wait bit                         */
   } BIT;                    /*                                        */
     unsigned char BYTE;     /* Byte Access                         */
};                           /* Chip select control register        */

