RT-Thread/rt-thread/bsp/m16c62p/drivers/iom16c62p.h
/*------------------------------------------------------
    Address match interrupt enable register //0x0009
------------------------------------------------------*/
union st_aier {               /* union AIER                               */
   struct {                    /* Bit  Access                            */
     unsigned char     AIER0:1;  /* Address match interrupt0 enable bit*/
     unsigned char     AIER1:1;  /* Address match interrupt1 enable bit*/
     unsigned char          :1;  /* Nothing assigned                     */
     unsigned char          :1;  /* Nothing assigned                     */
     unsigned char          :1;  /* Nothing assigned                      */
     unsigned char          :1;  /* Nothing assigned                      */
     unsigned char           :1;  /* Nothing assigned                     */
     unsigned char          :1;  /* Nothing assigned                      */
   } BIT;                       /*                                       */
     unsigned char BYTE;      /* Byte Access                         */
};                            /* Address match interrupt enable register    */


/*------------------------------------------------------
   Protect register //0x000A
-----------------------------------------------------*/
union st_prcr {               /* union PRCR                               */
   struct {                    /* Bit  Access                            */
     unsigned char     PRC0:1;   /* Enables writing to system clock control registers 0 & 1 */
     unsigned char     PRC1:1;   /* Enables writing to processor mode registers 0 & 1 */
     unsigned char     PRC2:1;   /* Enables writing to port P9 direction register & SI/Oi control register(i=3,4)*/
     unsigned char     PRC3:1;   /* Enable writting to Power supply detection register 2 and Power supply down detection register */
     unsigned char         :1;   /* Nothing assigned                      */
     unsigned char         :1;   /* Nothing assigned                      */
     unsigned char          :1;   /* Nothing assigned                     */
     unsigned char         :1;   /* Nothing assigned                      */
   } BIT;                       /*                                       */
     unsigned char BYTE;      /* Byte Access                         */
};                            /* Protect register                    */

/*------------------------------------------------------
    Data bank register //0x000B
------------------------------------------------------*/
union st_dbr {                /* union DBR                              */
   struct {                    /* Bit  Access                            */
     unsigned char         :1;   /* Nothing assigned                      */
     unsigned char         :1;   /* Nothing assigned                      */
     unsigned char     OFS :1;   /* Offset bit                         */
     unsigned char     BSR0:1;   /* Bank select bit 0                  */
     unsigned char     BSR1:1;   /* Bank select bit 1                  */
     unsigned char     BSR2:1;   /* Bank select bit 2                  */
     unsigned char          :1;   /* Nothing assigned                     */
     unsigned char         :1;   /* Nothing assigned                      */
   } BIT;                       /*                                       */
     unsigned char BYTE;      /* Data bank register                        */
};

/*------------------------------------------------------
    Oscillation stop detection register //0x000C
------------------------------------------------------*/
union st_cm2 {                /* union CM2                              */
   struct {                    /* Bit  Access                             */
     unsigned char     CM2_0:1;   /* Oscillation stop detection bit     */
     unsigned char     CM2_1:1;   /* Main clock switch bit              */
     unsigned char     CM2_2:1;   /* Oscillation stop detection status  */
     unsigned char     CM2_3:1;   /* Clock monitor bit                  */
     unsigned char          :1;   /* Nothing assigned                   */
     unsigned char          :1;   /* Nothing assigned                   */
     unsigned char           :1;   /* Nothing assigned                      */
     unsigned char     CM2_7:1;   /* Operation select bit(when an oscillation stop is detected) */
   } BIT;                        /*                                       */
     unsigned char BYTE;      /* Oscillation stop detection register                        */
};

/*------------------------------------------------------
   Watchdog timer control register //0x000f
-----------------------------------------------------*/
union st_wdc {               /* union WDC                               */
   struct {                  /* Bit  Access                            */
     unsigned char      B0:1;      /* High-order bit of watchdog timer    */
     unsigned char      B1:1;      /* High-order bit of watchdog timer    */
     unsigned char      B2:1;      /* High-order bit of watchdog timer    */
     unsigned char      B3:1;   /* High-order bit of watchdog timer    */
     unsigned char      B4:1;      /* High-order bit of watchdog timer    */
     unsigned char WDC5:1;      /* Cold start / warm start discrimination flag */
     unsigned char      B6:1;      /* Reserved bit, must always be 0        */
     unsigned char WDC7:1;   /* Prescaler select bit                */
   } BIT;                    /*                                        */
     unsigned char BYTE;     /*  Byte Access                         */
};                           /* Watchdog timer control register     */

/*------------------------------------------------------
   Address match interrupt register 0 //0x0010
-----------------------------------------------------*/
union st_rmad0 {
   struct{
    unsigned char RMAD0L;     /* Address match interrupt register 0 low  8 bit */
    unsigned char RMAD0M;     /* Address match interrupt register 0 mid  8 bit */
    unsigned char RMAD0H;     /* Address match interrupt register 0 high 8 bit */
    unsigned char NC;         /* non use                                        */
   } BYTE;                      /* Byte access                                   */
    unsigned long   DWORD;      /*    Word Access                                   */
};                              /* Address match interrupt register 0 32 bit        */

