RT-Thread/rt-thread/bsp/m16c62p/drivers/iom16c62p.h
/*------------------------------------------------------
   Address match interrupt register 1 //0x0014
-----------------------------------------------------*/
union st_rmad1 {
   struct{
    unsigned char RMAD1L;     /* Address match interrupt register 1 low  8 bit */
    unsigned char RMAD1M;     /* Address match interrupt register 1 mid  8 bit */
    unsigned char RMAD1H;     /* Address match interrupt register 1 high 8 bit */
    unsigned char NC;         /* non use                                        */
   } BYTE;                      /* Byte access                                   */
   unsigned long   DWORD;      /*    Word Access                                   */
};                              /* Address match interrupt register 1 32 bit        */

/*------------------------------------------------------
   Voltage Detection Register 1 //0x0019
-----------------------------------------------------*/
union st_vcr1 {               /* union VCR1                               */
   struct {                  /* Bit  Access                            */
     unsigned char       B0:1;     /* Reserved bit,must be 0              */
     unsigned char       B1:1;     /* Reserved bit,must be 0              */
     unsigned char       B2:1;     /* Reserved bit,must be 0              */
     unsigned char VC1_3:1;  /* Voltage down monitor flag           */
     unsigned char       B4:1;  /* Reserved bit,must be 0                */
     unsigned char    B5:1;  /* Reserved bit,must be 0              */
     unsigned char       B6:1;  /* Reserved bit, must always be 0        */
     unsigned char    B7:1;  /* Reserved bit,must be 0                */
   } BIT;                    /*                                        */
     unsigned char BYTE;     /*  Byte Access                         */
};                           /* Voltage Detection Register 1     */

/*------------------------------------------------------
   Voltage Detection Register 2 //0x001A
-----------------------------------------------------*/
union st_vcr2 {               /* union VCR2                               */
   struct {                  /* Bit  Access                            */
     unsigned char       B0:1;     /* Reserved bit,must be 0              */
     unsigned char       B1:1;     /* Reserved bit,must be 0              */
     unsigned char       B2:1;     /* Reserved bit,must be 0              */
     unsigned char    B3:1;  /* Reserved bit,must be 0           */
     unsigned char       B4:1;  /* Reserved bit,must be 0                */
     unsigned char    B5:1;  /* Reserved bit,must be 0              */
     unsigned char VC2_6:1;  /* Reset area monitor bit        */
     unsigned char VC2_7:1;  /* Voltage down monitor bit            */
   } BIT;                    /*                                        */
     unsigned char BYTE;     /*  Byte Access                         */
};                           /* Voltage Detection Register 1     */

/*------------------------------------------------------
   Chip select expansion control register//0x001B
-----------------------------------------------------*/
union st_cse {               /* union CSE                               */
   struct {                  /* Bit  Access                            */
     unsigned char CSE00W:1; /* CS0~ wait expansion bit */
     unsigned char CSE01W:1; /* CS0~ wait expansion bit */
     unsigned char CSE10W:1; /* CS1~ wait expansion bit */
     unsigned char CSE11W:1; /* CS1~ wait expansion bit */
     unsigned char CSE20W:1; /* CS2~ wait expansion bit */
     unsigned char CSE21W:1; /* CS2~ wait expansion bit */
     unsigned char CSE30W:1; /* CS3~ wait expansion bit */
     unsigned char CSE31W:1; /* CS3~ wait expansion bit */
   } BIT;                    /*                                        */
     unsigned char BYTE;     /*  Byte Access                         */
};                           /* Chip select expansion control register    */

/*------------------------------------------------------
   PLL control register 0 //0x001C
-----------------------------------------------------*/
union st_plc0 {               /* union                                 */
   struct {                  /* Bit  Access                            */
     unsigned char PLC00:1; /* Programmable counter select bit */
     unsigned char PLC01:1; /* Programmable counter select bit */
     unsigned char PLC02:1; /* Programmable counter select bit */
     unsigned char      :1; /* Nothing assigned */
     unsigned char      :1; /* Reserved bit,set to one */
     unsigned char      :1; /* Reserved bit,set to zero */
     unsigned char      :1; /* Reserved bit,set to zero */
     unsigned char PLC07:1; /* Operation enable bit */
   } BIT;                    /*                                        */
     unsigned char BYTE;     /*  Byte Access                         */
};                           /* PLL control register 0    */

/*------------------------------------------------------
   Processor mode register 2 //0x001E
-----------------------------------------------------*/
union st_pm2 {               /* union                                                    */
   struct {                  /* Bit  Access                                           */
     unsigned char PM2_0:1; /* Specifying wait when accessing SFR at PLL operation */
     unsigned char PM2_1:1; /* System clock protective bit */
     unsigned char PM2_2:1; /* WDT count source protective bit */
     unsigned char      :1; /* Reserved bit,set to zero */
     unsigned char      :1; /* Reserved bit,set to zero */
     unsigned char      :1; /* Nothing assigned */
     unsigned char      :1; /* Nothing assigned */
     unsigned char      :1; /* Nothing assigned */
   } BIT;                    /*                                        */
     unsigned char BYTE;     /*  Byte Access                         */
};                           /* Processor mode register 2    */

