RT-Thread/rt-thread/bsp/m16c62p/drivers/iom16c62p.h
/*------------------------------------------------------
   Power supply down detection register //0x001F
-----------------------------------------------------*/
union st_d4int {               /* union                                                    */
   struct {                  /* Bit  Access                                           */
     unsigned char D40:1; /* Power supply down detection interrupt enable bit */
     unsigned char D41:1; /* STOP mode deactivation control bit */
     unsigned char D42:1; /* Power supply change detection flag */
     unsigned char D43:1; /* WDT overflow detect flag */
     unsigned char DF0:1; /* Sampling clock select bit */
     unsigned char DF1:1; /* Sampling clock select bit */
     unsigned char    :1; /* Nothing assigned */
     unsigned char    :1; /* Nothing assigned */
   } BIT;                    /*                                        */
     unsigned char BYTE;     /*  Byte Access                         */
};                           /* Power supply down detection register   */

/*------------------------------------------------------
   DMA0 source pointer //0x0020
-----------------------------------------------------*/
union st_sar0 {
   struct{
    unsigned char SAR01;     /* DMA0 source pointer low  8 bit                  */
    unsigned char SAR0M;     /* DMA0 source pointer mid  8 bit                  */
    unsigned char SAR0H;     /* DMA0 source pointer high 8 bit                  */
    unsigned char NC;        /* non use                                      */
   } BYTE;                      /* Byte access                                     */
   unsigned long   DWORD;     /*    Word Access                                     */
};                             /* DMA0 source pointer 32 bit                      */

/*------------------------------------------------------
   DMA1 source pointer //0x0030
-----------------------------------------------------*/
union st_sar1 {
   struct{
    unsigned char SAR11;     /* DMA1 source pointer low  8 bit                  */
    unsigned char SAR1M;     /* DMA1 source pointer mid  8 bit                  */
    unsigned char SAR1H;     /* DMA1 source pointer high 8 bit                  */
    unsigned char NC;        /* non use                                      */
   } BYTE;                     /* Byte access                                     */
   unsigned long   DWORD;     /* Word Access                                     */
};                             /* DMA1 source pointer 32 bit                      */

/*------------------------------------------------------
   DMA0 destination pointer //0x0024
-----------------------------------------------------*/
union st_dar0 {                 /* DMA0 destination pointer 32 bit                    */
   struct{
    unsigned char DAR0L;     /* DMA0 destination pointer low  8 bit           */
    unsigned char DAR0M;     /* DMA0 destination pointer mid  8 bit          */
    unsigned char DAR0H;     /* DMA0 destination pointer high 8 bit           */
    unsigned char NC;        /* non use                                         */
   } BYTE;                     /* Byte access                                        */
    unsigned long DWORD;     /* Word Access                                        */
};

/*------------------------------------------------------
  DMA1 destination pointer //0x0034
-----------------------------------------------------*/
union st_dar1 {                  /* DMA1 destination pointer 32 bit             */
   struct{
    unsigned char DAR1L;     /* DMA1 destination pointer low  8 bit             */
    unsigned char DAR1M;     /* DMA1 destination pointer mid  8 bit             */
    unsigned char DAR1H;     /* DMA1 destination pointer high 8 bit             */
    unsigned char NC;        /* non use                                      */
   } BYTE;                     /* Byte access                                     */
   unsigned long   DWORD;     /* Word Access                                     */
};

/*------------------------------------------------------
  DMA0 transfer counter //0x0028
-----------------------------------------------------*/
union st_tcr0 {                   /* DMA0 transfer counter 16 bit                   */
   struct{
    unsigned char TCR0L;     /* DMA0 transfer counter low  8 bit              */
    unsigned char TCR0H;     /* DMA0 transfer counter high 8 bit              */
   } BYTE;                     /* Byte access                                      */
   unsigned short   WORD;     /* Word Access                                      */
};

/*------------------------------------------------------
  DMA1 transfer counter //0x0038
-----------------------------------------------------*/
union st_tcr1 {                  /* DMA1 transfer counter 16 bit                     */
   struct{
    unsigned char TCR1L;     /* DMA1 transfer counter low  8 bit                */
    unsigned char TCR1H;     /* DMA1 transfer counter high 8 bit                */
   } BYTE;                     /* Byte access                                        */
   unsigned short WORD;         /* Word Access                                        */
};

/*------------------------------------------------------
    DMA0 control register //0x002c
------------------------------------------------------*/
union st_dm0con {               /* DMA0 control register                */
   struct{
     unsigned char    DMBIT:1; /* Transfer unit bit select bit                 */
     unsigned char    DMASL:1; /* Repeat transfer mode select bit             */
     unsigned char    DMAS :1; /* DMA request bit                             */
     unsigned char    DMAE :1; /* DMA enable bit                             */
     unsigned char    DSD  :1; /* Source address direction select bit       */
     unsigned char    DAD  :1; /* Destination address direction select bit  */
     unsigned char           :1;
     unsigned char         :1;
   }BIT;
    unsigned char  BYTE;
};

