RT-Thread/rt-thread/bsp/m16c62p/drivers/iom16c62p.h
/*------------------------------------------------------
    DMA1 control register //0x003c
------------------------------------------------------*/
union st_dm1con {        /*    DMA1 control register union */
    struct{
     unsigned char    DMBIT:1; /* Transfer unit bit select bit                 */
     unsigned char    DMASL:1; /* Repeat transfer mode select bit             */
     unsigned char    DMAS :1; /* DMA request bit                             */
     unsigned char    DMAE :1; /* DMA enable bit                             */
     unsigned char    DSD  :1; /* Source address direction select bit          */
     unsigned char    DAD  :1; /* Destination address direction select bit  */
     unsigned char           :1; /*Nothing assigned */
     unsigned char         :1; /*Nothing assigned */
    }BIT;
    unsigned char  BYTE;
};

union st_icr {                    /*    interrupt control registers      */
    struct{
     unsigned char    ILVL0:1; /* Interrupt priority level select bit */
     unsigned char    ILVL1:1; /* Interrupt priority level select bit */
     unsigned char    ILVL2:1; /* Interrupt priority level select bit */
     unsigned char    IR   :1; /* Interrupt request bit               */
     unsigned char    POL  :1; /* Polarity select bit                   */
     unsigned char         :1; /* Reserved bit, set to 0              */
     unsigned char           :1; /* Nothing assigned                      */
     unsigned char         :1; /* Nothing assigned                      */
    }BIT;
    unsigned char    BYTE;
};

union st_icr1 {                    /*    interrupt control registers      */
    struct{
     unsigned char    ILVL0:1; /* Interrupt priority level select bit */
     unsigned char    ILVL1:1; /* Interrupt priority level select bit */
     unsigned char    ILVL2:1; /* Interrupt priority level select bit */
     unsigned char    IR   :1; /* Interrupt request bit               */
     unsigned char         :1; /* Nothing assigned                      */
     unsigned char         :1; /* Nothing assigned                      */
     unsigned char           :1; /* Nothing assigned                      */
     unsigned char         :1; /* Nothing assigned                      */
    }BIT;
    unsigned char    BYTE;
};

/*------------------------------------------------------
     bcnic //0x004a
------------------------------------------------------*/
union st_bcnic {                    /*    interrupt control registers*/
    struct{
     unsigned char    ILVL0_BCNIC:1;/* Interrupt priority level select bit */
     unsigned char    ILVL1_BCNIC:1;/* Interrupt priority level select bit */
     unsigned char    ILVL2_BCNIC:1;/* Interrupt priority level select bit */
     unsigned char    IR_BCNIC   :1;/* Interrupt request bit */
     unsigned char                 :1;
     unsigned char               :1;
     unsigned char               :1;
     unsigned char               :1;
    }BIT;
    unsigned char    BYTE;
};

/*------------------------------------------------------
     dm0ic //0x004b
------------------------------------------------------*/
union st_dm0ic {                    /*    interrupt control registers*/
    struct{
     unsigned char    ILVL0_DM0IC:1;/* Interrupt priority level select bit */
     unsigned char    ILVL1_DM0IC:1;/* Interrupt priority level select bit */
     unsigned char    ILVL2_DM0IC:1;/* Interrupt priority level select bit */
     unsigned char    IR_DM0IC   :1;/* Interrupt request bit               */
     unsigned char                 :1;
     unsigned char               :1;
     unsigned char               :1;
     unsigned char               :1;
    }BIT;
    unsigned char    BYTE;
};

/*------------------------------------------------------
    Flash identification register //0x01b4
------------------------------------------------------*/
union st_fidr {                   /*    Flash identification register         */
    struct{
     unsigned char    FIDR0:1; /* Flash identification value */
     unsigned char    FIDR1:1; /* Flash identification value */
     unsigned char         :1; /* Nothing assigned                            */
     unsigned char         :1; /* Nothing assigned                            */
     unsigned char         :1; /* Nothing assigned                          */
     unsigned char         :1; /* Nothing assigned                          */
     unsigned char           :1; /* Nothing assigned */
     unsigned char         :1; /* Nothing assigned */
    }BIT;
    unsigned char  BYTE;
};

/*------------------------------------------------------
    Flash memory control register 1 //0x01b5
------------------------------------------------------*/
union st_fmr1 {                   /*    Flash identification register         */
    struct{
     unsigned char         :1; /* Reserved bit   */
     unsigned char    FMR11:1; /* EW1 mode select bit */
     unsigned char         :1; /* Reserved bit   */
     unsigned char         :1; /* Reserved bit   */
     unsigned char         :1; /* Reserved bit    */
     unsigned char         :1; /* Reserved bit    */
     unsigned char    FMR16:1; /* Lock bit status flag */
     unsigned char         :1; /* Reserved bit   */
    }BIT;
    unsigned char  BYTE;
};

/*------------------------------------------------------
    Flash memory control register 0 //0x01b7
------------------------------------------------------*/
union st_fmr0 {                   /*    Flash identification register         */
    struct{
     unsigned char    FMR00:1; /* RY/BY~ status flag */
     unsigned char    FMR01:1; /* EW0 mode select bit */
     unsigned char    FMR02:1; /* Lock bit disable bit */
     unsigned char    FMSTP:1; /* Flash memory stop bit */
     unsigned char         :1; /* Reserved bit    */
     unsigned char    FMR05:1; /* User ROM area select bit */
     unsigned char    FMR06:1; /* Program status flag */
     unsigned char    FMR07:1; /* Erase status flag */
    }BIT;
    unsigned char  BYTE;
};

