RT-Thread/rt-thread/bsp/m16c62p/drivers/iom16c62p.h
/*------------------------------------------------------
   Address match interrupt register 2 //0x01b8
-----------------------------------------------------*/
union st_rmad2 {
   struct{
    unsigned char RMAD2L;     /* Address match interrupt register 2 low  8 bit */
    unsigned char RMAD2M;     /* Address match interrupt register 2 mid  8 bit */
    unsigned char RMAD2H;     /* Address match interrupt register 2 high 8 bit */
    unsigned char NC;         /* non use                                        */
   } BYTE;                      /* Byte access                                   */
   unsigned long   DWORD;      /*    Word Access                                   */
};                              /* Address match interrupt register 2 32 bit        */


/*------------------------------------------------------
    Address match interrupt enable register 2 //0x01bb
------------------------------------------------------*/
union st_aier2 {                   /* Address match interrupt enable register 2        */
    struct{
     unsigned char    AIER20:1; /* Address match interrupt 2 enable bit */
     unsigned char    AIER21:1; /* Address match interrupt 3 enable bit */
     unsigned char          :1; /* Nothing assigned */
     unsigned char          :1; /* Nothing assigned */
     unsigned char          :1; /* Nothing assigned    */
     unsigned char          :1; /* Nothing assigned */
     unsigned char          :1; /* Nothing assigned */
     unsigned char          :1; /* Nothing assigned */
    }BIT;
    unsigned char  BYTE;
};

/*------------------------------------------------------
   Address match interrupt register 3 //0x01bc
-----------------------------------------------------*/
union st_rmad3 {
   struct{
    unsigned char RMAD3L;     /* Address match interrupt register 3 low  8 bit */
    unsigned char RMAD3M;     /* Address match interrupt register 3 mid  8 bit */
    unsigned char RMAD3H;     /* Address match interrupt register 3 high 8 bit */
    unsigned char NC;         /* non use                                        */
   } BYTE;                      /* Byte access                                   */
   unsigned long   DWORD;      /*    Word Access                                   */
};                              /* Address match interrupt register 3 32 bit        */

/*------------------------------------------------------
    Peripheral clock select register //0x025e
------------------------------------------------------*/
union st_pclkr {                   /* Peripheral clock select register        */
    struct{
     unsigned char    PCLK0 :1; /* TimerA,B clock select bit */
     unsigned char    PCLK1 :1; /* SI/O clock select bit */
     unsigned char          :1; /* Reserved bit,set to 0 */
     unsigned char          :1; /* Reserved bit,set to 0 */
     unsigned char          :1; /* Reserved bit,set to 0    */
     unsigned char          :1; /* Reserved bit,set to 0 */
     unsigned char          :1; /* Reserved bit,set to 0 */
     unsigned char          :1; /* Reserved bit,set to 0 */
    }BIT;
    unsigned char  BYTE;
};

/*------------------------------------------------------
    Timer B3,4,5 Count start flag //0x0340
------------------------------------------------------*/
union st_tbsr {              /* union tbsr                               */
    struct {                 /* Bit  Access                            */
     unsigned char         :1;  /* Nothing Assigned                    */
     unsigned char         :1;  /* Nothing Assigned                    */
     unsigned char         :1;  /* Nothing Assigned                    */
     unsigned char         :1;  /* Nothing Assigned                    */
     unsigned char         :1;  /* Nothing Assigned                    */
     unsigned char     TB3S:1;  /* Timer B3 count start flag             */
     unsigned char     TB4S:1;  /* Timer B4 count start flag             */
     unsigned char     TB5S:1;  /* Timer B5 count start flag             */
    } BIT;                    /*                                        */
    unsigned  char BYTE;     /*  Byte Access                         */
};                           /* Timer B3,4,5 Count start flag       */

/*------------------------------------------------------
   Three-phase PWM control regester 0 //0x0348
------------------------------------------------------*/
union st_invc0 {            /* union invc0                                */
    struct {                /* Bit  Access                                */
     unsigned char     INV00:1;/* Effective interrupt output polarity select bit */
     unsigned char     INV01:1;/* Effective interrupt output specification bit */
     unsigned char     INV02:1;/* Mode select bit                         */
     unsigned char     INV03:1;/* Output control bit                     */
     unsigned char     INV04:1;/* Positive and negative phases concurrent L output disable function enable bit */
     unsigned char     INV05:1;/* Positive and negative phases concurrent L output detect flag */
     unsigned char     INV06:1;/* Modulation mode select bit             */
     unsigned char     INV07:1;/* Software trigger bit                 */
    } BIT;                    /*                                        */
     unsigned char BYTE;    /*  Byte Access                         */
};                          /*                                         */

/*------------------------------------------------------
    Three-phase PWM control regester 1 //0x0349
------------------------------------------------------*/
union st_invc1 {            /* union invc1                                    */
    struct {                /* Bit  Access                                    */
     unsigned char     INV10:1;/* Timer Ai start trigger signal select bit */
     unsigned char     INV11:1;/* Timer A1-1,A2-1,A4-1 control bit         */
     unsigned char     INV12:1;/* Short circuit timer count source select bit*/
     unsigned char          :1;/* Nothing Assigned                            */
     unsigned char          :1;/* Reserved bit (always 0)                    */
     unsigned char          :1;/* Nothing Assigned                            */
     unsigned char           :1;/* Nothing Assigned                            */
     unsigned char          :1;/* Nothing Assigned                            */
    } BIT;                    /*                                            */
    unsigned char BYTE;     /*  Byte Access                             */
};                          /*                                             */

