RT-Thread/rt-thread/bsp/m16c62p/drivers/iom16c62p.h
/*------------------------------------------------------
    Three-phase output buffer register 0 //0x034a
------------------------------------------------------*/
union st_idb0 {            /* union idb0                                */
    struct {                  /* Bit  Access                                */
     unsigned char     DU0 :1;/* U  phase output buffer 0                 */
     unsigned char     DUB0:1;/* U~ phase output buffer 0                 */
     unsigned char     DV0 :1;/* V  phase output buffer 0                 */
     unsigned char     DVB0:1;/* V~ phase output buffer 0                 */
     unsigned char     DW0 :1;/* W  phase output buffer 0                 */
     unsigned char     DWB0:1;/* W~ phase output buffer 0                 */
     unsigned char         :1;/* Nothing Assigned                        */
     unsigned char         :1;/* Nothing Assigned                        */
    } BIT;                     /*                                        */
    unsigned char BYTE;    /*  Byte Access                             */
};                         /*                                         */

/*------------------------------------------------------
    Three-phase output buffer register 1 //0x034b
------------------------------------------------------*/
union st_idb1 {            /* union idb1                                */
    struct {               /* Bit  Access                                */
     unsigned char     DU1 :1;/* U  phase output buffer 1                */
     unsigned char    DUB1:1;/* U~ phase output buffer 1                 */
     unsigned char    DV1 :1;/* V  phase output buffer 1                 */
     unsigned char    DVB1:1;/* V~ phase output buffer 1                 */
     unsigned char    DW1 :1;/* W  phase output buffer 1                 */
     unsigned char    DWB1:1;/* W~ phase output buffer 1                 */
     unsigned char        :1;/* Nothing Assigned                        */
     unsigned char        :1;/* Nothing Assigned                        */
    } BIT;                  /*                                        */
    unsigned char BYTE;    /*  Byte Access                             */
};                         /*                                         */

/*----------------------------------------------------------------------------------
   Timer mode registers  //0x035b,0x035c,0x035d,0x0396,
                           0x0397,0x0398,0x0399,0x039a,0x039b,0x039c
---------------------------------------------------------------------------------*/
union st_tmr {               /* union tmr                               */
    struct {                  /* Bit  Access                            */
     unsigned char     TMOD0:1; /* Operation mode select bit             */
     unsigned char    TMOD1:1; /* Operation mode select bit             */
     unsigned char    MR0     :1; /* Pulse output function select bit    */
     unsigned char    MR1  :1; /* External trigger select bit            */
     unsigned char    MR2  :1; /* Trigger select bit                    */
     unsigned char    MR3  :1; /* Must always be "0" in one-shot timer*/
     unsigned char    TCK0 :1; /* Count source select bit             */
     unsigned char    TCK1 :1; /* Count source select bit             */
    } BIT;                     /*                                       */
    unsigned char BYTE;      /*  Byte Access                         */
};

/*------------------------------------------------------
   Interrupt request cause select register 2  //0x035e
------------------------------------------------------*/
union st_ifsr2a {               /* union ifsr2a                              */
    struct {                  /* Bit  Access                 */
     unsigned char           :1; /* Nothing assigned            */
     unsigned char          :1; /* Nothing assigned             */
     unsigned char          :1; /* Nothing assigned            */
     unsigned char          :1; /* Nothing assigned            */
     unsigned char          :1; /* Nothing assigned            */
     unsigned char          :1; /* Nothing assigned            */
     unsigned char IFSR26 :1; /* Interrupt request cause select bit */
     unsigned char IFSR27 :1; /* Interrupt request cause select bit */
    } BIT;                     /*                                       */
    unsigned char BYTE;      /*  Byte Access                         */
};

/*------------------------------------------------------
Interrupt request cause select register //0x035f
-----------------------------------------------------*/
union st_ifsr {              /* union IFSR                                   */
    struct {                  /* Bit  Access                                */
     unsigned char     IFSR0:1; /* INT0~ interrupt polarity switching bit  */
     unsigned char    IFSR1:1; /* INT1~ interrupt polarity switching bit  */
     unsigned char    IFSR2:1; /* INT2~ interrupt polarity switching bit  */
     unsigned char    IFSR3:1; /* INT3~ interrupt polarity switching bit  */
     unsigned char    IFSR4:1; /* INT4~ interrupt polarity switching bit  */
     unsigned char    IFSR5:1; /* INT5~ interrupt polarity switching bit  */
     unsigned char    IFSR6:1; /* Interrupt request cause select bit         */
     unsigned char    IFSR7:1; /* Interrupt request cause select bit         */
    } BIT;                     /*                                            */
    unsigned char BYTE;      /*  Byte Access                             */
};                           /*                                         */

/*------------------------------------------------------
   SI/O4 control registers //0x0360
------------------------------------------------------*/
union st_s4c {              /* union S4C                                   */
    struct {                   /* Bit  Access                                    */
     unsigned char     SM40:1; /* Internal synchronous clock select bit */
     unsigned char    SM41:1; /* Internal synchronous clock select bit */
     unsigned char    SM42:1; /* Sout4 output disable bit */
     unsigned char    SM43:1; /* SI/O4 port select bit */
     unsigned char    SM44:1; /* CLK polarity select bit */
     unsigned char    SM45:1; /* Transfer direction select bit */
     unsigned char    SM46:1; /* Synchronous clock select bit */
     unsigned char    SM47:1; /* Sout4 initial value set bit */
    } BIT;                   /*                                            */
    unsigned char BYTE;     /*  Byte Access                             */
};

