RT-Thread/rt-thread/bsp/m16c62p/drivers/iom16c62p.h
/*------------------------------------------------------
   UART1 special mode register 3 //0x0371
------------------------------------------------------*/
union st_u1smr3 {              /* union u1smr3                                 */
    struct {                   /* Bit  Access                                    */
     unsigned char            :1; /* Nothing is assigned                */
     unsigned char    CKPH   :1; /* Clock phase set bit                */
     unsigned char           :1; /* Nothing is assigned                */
     unsigned char    NODC   :1; /* Clock output set bit               */
     unsigned char           :1; /* Nothing is assigned                */
     unsigned char    DL0    :1; /* SDA1(TxD1) digital delay setup bit */
     unsigned char    DL1    :1; /* SDA1(TxD1) digital delay setup bit */
     unsigned char    DL2    :1; /* SDA1(TxD1) digital delay setup bit */
    } BIT;                         /*                                     */
    unsigned char BYTE;        /*  Byte Access                          */
};                             /*                                      */

/*------------------------------------------------------
   UART1 special mode register 2 //0x0372
------------------------------------------------------*/
union st_u1smr2 {              /* union u1smr2                                 */
    struct {                   /* Bit  Access                                    */
     unsigned char     IICM2 :1; /* IIC mode selection bit 2 */
     unsigned char    CSC   :1; /* Clock-synchronous bit    */
     unsigned char    SWC   :1; /* SCL wait output bit      */
     unsigned char    ALS   :1; /* SDA output stop bit      */
     unsigned char    STAC  :1; /* UART0 initialization bit */
     unsigned char    SWC2  :1; /* SCL wait output bit 2    */
     unsigned char    SDHI  :1; /* SDA output disable bit   */
     unsigned char          :1; /* Nothing is assigned      */
    } BIT;                         /*                                     */
    unsigned char BYTE;        /*  Byte Access                          */
};                             /*                                      */

/*------------------------------------------------------
   UART1 special mode register  //0x0373
------------------------------------------------------*/
union st_u1smr {              /* union u1smr                                 */
    struct {                   /* Bit  Access                                    */
     unsigned char     IICM:1; /* IIC mode selection bit */
     unsigned char    ABC :1; /* Arbitration lost detecting flag control bit */
     unsigned char    BBS :1; /* Bus busy flag */
     unsigned char        :1; /* Reserved bit,set to 0 */
     unsigned char    ABSC:1; /* Bus collision detect sampling clock select bit */
     unsigned char    ACSE:1; /* Auto clear function select bit of transmit enable bit */
     unsigned char    SSS :1; /* Transmit start condition select bit */
     unsigned char        :1; /* Nothing is assigned      */
    } BIT;                         /*                                     */
    unsigned char BYTE;        /*  Byte Access                          */
};                             /*                                      */

/*------------------------------------------------------
   UART2 special mode register 4 //0x0374
------------------------------------------------------*/
union st_u2smr4 {              /* union u1smr4                                 */
    struct {                   /* Bit  Access                                    */
     unsigned char     STAREQ:1; /* Start condition generate bit */
     unsigned char    RSTARE:1; /* Restart condition generate bit */
     unsigned char    STPREQ:1; /* Stop condition generate bit */
     unsigned char    STSPSE:1; /* SCL,SDA output select bit */
     unsigned char    ACKD  :1; /* ACK data bit */
     unsigned char    ACKC  :1; /* ACK data output enable bit */
     unsigned char    SCLHI :1; /* SCL output stop enable bit */
     unsigned char    SWC9  :1; /* Final bit L hold enable bit */
    } BIT;                         /*                                     */
    unsigned char BYTE;        /*  Byte Access                          */
};                             /*                                      */

/*------------------------------------------------------
    UART2 special mode register 3 //0x0375
------------------------------------------------------*/
union st_u2smr3 {              /* union U2SMR3                               */
    struct {                   /* Bit  Access                                */
     unsigned char            :1; /* Nothing is assigned                */
     unsigned char     CKPH  :1; /* Clock phase set bit                */
     unsigned char           :1; /* Nothing is assigned                */
     unsigned char     NODC  :1; /* Clock output set bit               */
     unsigned char           :1; /* Nothing is assigned                */
     unsigned char     DL0   :1; /* SDA digital delay setup bit             */
     unsigned char     DL1   :1; /* SDA digital delay setup bit             */
     unsigned char     DL2   :1; /* SDA digital delay setup bit             */
    } BIT;                   /*                                        */
    unsigned char BYTE;     /*  Byte Access                         */
};                          /*                                         */

/*------------------------------------------------------
    UART2 special mode register 2 //0x0376
------------------------------------------------------*/
union st_u2smr2 {            /* union U2SMR2                               */
    struct {                 /* Bit  Access                                */
     unsigned char     IICM2:1; /* IIC mode selection bit 2                */
     unsigned char    CSC  :1; /* Clock-synchronous bit                     */
     unsigned char    SWC  :1; /* SCL wait output bit                     */
     unsigned char    ALS  :1; /* SDA output stop bit                     */
     unsigned char    STAC :1; /* UART2 initialization bit                 */
     unsigned char    SWC2 :1; /* SCL wait output bit 2                     */
     unsigned char    SDHI :1; /* SDA output disable bit                    */
     unsigned char         :1; /* Nothing is assigned        */
    } BIT;                    /*                                            */
    unsigned char BYTE;      /*  Byte Access                             */
};                           /*                                         */

