RT-Thread/rt-thread/bsp/m16c62p/drivers/iom16c62p.h
/*------------------------------------------------------
    UART2 special mode register //0x0377
------------------------------------------------------*/
union st_u2smr {             /* union U2SMR                                       */
    struct {                  /* Bit  Access                                    */
     unsigned char     IICM :1; /* IIC mode selection bit                        */
     unsigned char    ABC  :1; /* Arbitration lost detecting flag control bit */
     unsigned char    BBS  :1; /* Reserved bit,set to 0                            */
     unsigned char         :1; /* SCLL sync output enable bit                 */
     unsigned char    ABSCS:1; /* Bus collision detect sampling clock select bit */
     unsigned char    ACSE :1; /* Auto clear function select bit of transmit enable bit */
     unsigned char    SSS  :1; /* Transmit start condition select bit            */
     unsigned char         :1; /* Nothing is assigned                 */
    } BIT;                     /*                                                    */
    unsigned char BYTE;      /*  Byte Access                                 */
};                           /*                                                 */

/*------------------------------------------------------
    UART2 transmit/receive mode register //0x0378
------------------------------------------------------*/
union st_u2mr {                    /* union U2MR                                   */
    struct {                       /* Bit  Access                               */
     unsigned char     SMD0_U2MR :1; /* Serial I/O mode select bit             */
     unsigned char    SMD1_U2MR :1; /* Serial I/O mode select bit             */
     unsigned char    SMD2_U2MR :1; /* Serial I/O mode select bit             */
     unsigned char    CKDIR_U2MR:1; /* Internal/external clock select bit        */
     unsigned char    STPS_U2MR :1; /* Stop bit length select bit             */
     unsigned char    PRY_U2MR  :1; /* Odd/even parity select bit             */
     unsigned char    PRYE_U2MR :1; /* Parity enable bit                         */
     unsigned char    IOPOL_U2MR:1; /* TxD RxD I/O polarity reverse bit         */
    } BIT;                          /*                                                    */
    unsigned char BYTE;           /*  Byte Access                            */
};

/*------------------------------------------------------
    UART2 Transmit buffer register 16 bit //0x037a
------------------------------------------------------*/
union st_u2tb {                 /* UART2 Transmit buffer register 16 bit ; Use "MOV" instruction when writing to this register. */
   struct{
    unsigned char U2TBL;     /* UART2 Transmit buffer register low  8 bit      */
    unsigned char U2TBH;     /* UART2 Transmit buffer register high 8 bit       */
   } BYTE;                      /* Byte access                                        */
   unsigned short   WORD;     /* Word Access                                        */
};

/*------------------------------------------------------
    UART2 transmit/receive control register 0//0x037c
------------------------------------------------------*/
union st_u2c0 {                  /* union U2C0                                   */
    struct {                     /* Bit  Access                                   */
     unsigned char     CLK0 :1;     /* BRG count source select bit                 */
     unsigned char    CLK1 :1;     /* BRG count source select bit                 */
     unsigned char    CRS  :1;     /* CTS~/RTS~ function select bit             */
     unsigned char    TXEPT:1;     /* Transmit register empty flag             */
     unsigned char    CRD  :1;     /* CTS~/RTS~ disable bit                     */
     unsigned char         :1;     /* Nothing Assigned                            */
     unsigned char    CKPOL:1;     /* CLK polarity select bit                     */
     unsigned char    UFORM:1;     /* Transfer format select bit                 */
    } BIT;                        /*                                               */
    unsigned char BYTE;         /* Byte Access                                 */
};                                 /* UART2 transmit/receive control register 0*/

/*------------------------------------------------------
    UART2 transmit/receive control register 1 //0x037d
-----------------------------------------------------*/
union st_u2c1 {                  /* union U2C1                                   */
    struct {                     /* Bit  Access                                   */
     unsigned char     TE_U2C1:1;     /* Transmit enable bit                         */
     unsigned char    TI_U2C1:1;     /* Transmit buffer empty flag                 */
     unsigned char    RE_U2C1:1;     /* Receive enable bit                         */
     unsigned char    RI_U2C1:1;     /* Receive complete flag                     */
     unsigned char    U2IRS  :1;     /* UART2 transmit interrupt cause select bit*/
     unsigned char    U2RRM  :1;     /* UART2 continuous receive mode enable bit */
     unsigned char    U2LCH  :1;     /* Data logic select bit                     */
     unsigned char    U2ERE  :1;     /* Error signal output enable bit             */
    } BIT;                        /*                                               */
    unsigned char BYTE;         /* Byte Access                                 */
};                                 /*UART2 transmit/receive control register 1 */

/*------------------------------------------------------
    UART2 receive buffer registers //0x037e
------------------------------------------------------*/
union st_u2rb {                     /* UART2 receive buffer register */
    struct {                        /*  Bit  Access */
     unsigned char             :1;        /*  Receive data                       */
     unsigned char            :1;        /*  Receive data                       */
     unsigned char            :1;        /*  Receive data                       */
     unsigned char            :1;        /*  Receive data                       */
     unsigned char            :1;        /*  Receive data                       */
     unsigned char            :1;        /*  Receive data                       */
     unsigned char            :1;        /*  Receive data                       */
     unsigned char            :1;        /*  Receive data                       */
     unsigned char           :1;        /*  Receive data                       */
     unsigned char           :1;        /* Nothing assigned                       */
     unsigned char           :1;        /* Nothing assigned                       */
      unsigned char  ABT_U2RB:1;     /* Arbitration lost detecting flag  */
      unsigned char  OER_U2RB:1;     /* Overrun error flag                 */
      unsigned char  FER_U2RB:1;     /* Framing error flag                */
      unsigned char  PER_U2RB:1;     /* Parity error flag                 */
      unsigned char  SUM_U2RB:1;     /* Error sum flag                     */
    }BIT;
    struct{
      unsigned char    U2RBL;        /* Low  8 bit                        */
      unsigned char    U2RBH;        /* High 8 bit                         */
    }BYTE;
    unsigned short  WORD;
};

