RT-Thread/rt-thread/bsp/m16c62p/drivers/iom16c62p.h
/*------------------------------------------------------
    Count start flag //0x0380
------------------------------------------------------*/
union st_tabsr {                  /* union TABSR                                   */
    struct {                     /* Bit  Access                                   */
     unsigned char    TA0S:1;     /* Timer A0 count start flag                 */
     unsigned char    TA1S:1;     /* Timer A1 count start flag                 */
     unsigned char    TA2S:1;     /* Timer A2 count start flag                 */
     unsigned char    TA3S:1;     /* Timer A3 count start flag                 */
     unsigned char    TA4S:1;     /* Timer A4 count start flag                 */
     unsigned char    TB0S:1;     /* Timer B0 count start flag                 */
     unsigned char    TB1S:1;     /* Timer B1 count start flag                 */
     unsigned char    TB2S:1;     /* Timer B2 count start flag                 */
    } BIT;                        /*                                               */
    unsigned char BYTE;         /* Byte Access                                 */
};                                 /*UART2 transmit/receive control register 1 */

/*------------------------------------------------------
    Clock prescaler reset flag //0x0381
------------------------------------------------------*/
union st_cpsrf {              /* union CPSRF                                   */
struct {      /* Bit  Access                                   */
     unsigned char         :1;   /*                                             */
     unsigned char         :1;   /*                                             */
     unsigned char         :1;   /*                                             */
     unsigned char         :1;   /*                                             */
     unsigned char         :1;   /*                                              */
     unsigned char         :1;   /*                                              */
     unsigned char          :1;   /*                                             */
     unsigned char     CPSR:1;   /* Clock prescaler reset flag                 */
        } BIT;         /*                                               */
     unsigned char BYTE;      /* Byte Access                                 */
};                            /* Watchdog timer start register                */

/*------------------------------------------------------
    One-shot start flag //0x0382
------------------------------------------------------*/
union st_onsf {                  /* union ONSF                                   */
    struct {                     /* Bit  Access                                   */
     unsigned char      TA0OS:1;     /* Timer A0 one-shot start flag             */
     unsigned char      TA1OS:1;     /* Timer A1 one-shot start flag             */
     unsigned char     TA2OS:1;     /* Timer A2 one-shot start flag             */
     unsigned char     TA3OS:1;     /* Timer A3 one-shot start flag             */
     unsigned char     TA4OS:1;     /* Timer A4 one-shot start flag             */
     unsigned char     TAZIE:1;     /* Z phase input enable bit                 */
     unsigned char    TA0TGL:1;     /* Timer A0 event/trigger select bit         */
     unsigned char    TA0TGH:1;     /* Timer A0 event/trigger select bit         */
    } BIT;                        /*                                               */
    unsigned char BYTE;         /* Byte Access                                 */
};                                 /*UART2 transmit/receive control register 1 */

/*------------------------------------------------------
    Trigger select register //0x0383
------------------------------------------------------*/
union st_trgsr {                  /* union TRGSR                                   */
        struct {                 /* Bit  Access                                   */
     unsigned char     TA1TGL:1;     /* Timer A1 event/trigger select bit         */
     unsigned char    TA1TGH:1;     /* Timer A1 event/trigger select bit         */
     unsigned char    TA2TGL:1;     /* Timer A2 event/trigger select bit         */
     unsigned char    TA2TGH:1;     /* Timer A2 event/trigger select bit         */
     unsigned char    TA3TGL:1;     /* Timer A3 event/trigger select bit         */
     unsigned char    TA3TGH:1;     /* Timer A3 event/trigger select bit         */
     unsigned char    TA4TGL:1;     /* Timer A4 event/trigger select bit         */
     unsigned char    TA4TGH:1;     /* Timer A4 event/trigger select bit         */
    } BIT;                        /*                                               */
    unsigned char BYTE;               /* Byte Access                                 */
};                                 /*UART2 transmit/receive control register 1 */

/*------------------------------------------------------
    Timer B2 special mode register //0x039e
------------------------------------------------------*/
union st_tb2sc {                  /* union tb2sc                                    */
        struct {                 /* Bit  Access                                    */
     unsigned char     PWCON :1;     /* Timer B2 reload timing switching bit      */
     unsigned char    IVPCR1:1;     /* Three phase output port NMI control bit 1 */
     unsigned char          :1;     /* Nothing is assigned                          */
     unsigned char          :1;     /* Nothing is assigned                       */
     unsigned char          :1;     /* Nothing is assigned                       */
     unsigned char          :1;     /* Nothing is assigned                       */
     unsigned char          :1;     /* Nothing is assigned                       */
     unsigned char          :1;     /* Nothing is assigned                       */
    } BIT;                        /*                                                */
    unsigned char BYTE;         /* Byte Access                                 */
};                                 /*UART2 transmit/receive control register 1 */

