RT-Thread/rt-thread/bsp/m16c62p/drivers/iom16c62p.h
/*------------------------------------------------------
    UART0 transmit/receive mode register //0x03a0
------------------------------------------------------*/
union st_u0mr {                    /* union U0MR                                   */
    struct {                       /* Bit  Access                               */
     unsigned char     SMD0_U0MR :1; /* Serial I/O mode select bit             */
     unsigned char     SMD1_U0MR :1; /* Serial I/O mode select bit             */
     unsigned char     SMD2_U0MR :1; /* Serial I/O mode select bit             */
     unsigned char     CKDIR_U0MR:1; /* Internal/external clock select bit     */
     unsigned char     STPS_U0MR :1; /* Stop bit length select bit             */
     unsigned char     PRY_U0MR  :1; /* Odd/even parity select bit             */
     unsigned char     PRYE_U0MR :1; /* Parity enable bit                         */
     unsigned char     IOPOL_U0MR :1; /* TxD,RxD I/O polarity reverse bit        */
    } BIT;                            /*                                               */
    unsigned char BYTE;           /* Byte Access                             */
};

/*------------------------------------------------------
    UART0 transmit/receive mode register //0x03a2
------------------------------------------------------*/
union st_u0tb {                /* UART0 Transmit buffer register 16 bit ; Use "MOV" instruction when writing to this register. */
   struct{
    unsigned char U0TBL;     /* UART0 Transmit buffer register low  8 bit      */
    unsigned char U0TBH;     /* UART0 Transmit buffer register high 8 bit      */
   } BYTE;                     /* Byte access                                        */
   unsigned short   WORD;     /* Word Access                                        */
};

/*------------------------------------------------------
    UARTi transmit/receive control register 0 //0x03a4
------------------------------------------------------*/
union st_u0c0 {                  /* union U0C0                                   */
    struct {                     /* Bit  Access                                   */
     unsigned char     CLK0 :1;     /* BRG count source select bit                 */
     unsigned char    CLK1 :1;     /* BRG count source select bit                 */
     unsigned char    CRS  :1;     /* CTS~/RTS~ function select bit             */
     unsigned char    TXEPT:1;     /* Transmit register empty flag             */
     unsigned char    CRD  :1;     /* CTS~/RTS~ disable bit                     */
     unsigned char    NCH  :1;     /* Data output select bit                     */
     unsigned char    CKPOL:1;     /* CLK polarity select bit                     */
     unsigned char    UFORM:1;     /* Transfer format select bit                 */
    } BIT;                        /*                                               */
    unsigned char BYTE;         /* Byte Access                                 */
};                                 /*UARTi transmit/receive control register 0 */

/*------------------------------------------------------
    UART0 transmit/receive control register 1 //0x03a5
------------------------------------------------------*/
union st_u0c1 {             /* union U0C1                                       */
    struct {                /* Bit  Access                                       */
     unsigned char     TE     :1;     /* Transmit enable bit                             */
     unsigned char    TI     :1;     /* Transmit buffer empty flag                     */
     unsigned char    RE     :1;     /* Receive enable bit                             */
     unsigned char    RI     :1;     /* Receive complete flag                         */
     unsigned char           :1;     /* Nothing Assigned                                 */
     unsigned char           :1;     /* Nothing Assigned                                 */
     unsigned char    U0LCH  :1;     /* Data logic select bit */
     unsigned char    U0ERE  :1;     /* Error signal output enable bit */
    } BIT;                   /*                                                   */
    unsigned char BYTE;     /* Byte Access                                     */
};                             /*UART0 transmit/receive control register 1     */

/*------------------------------------------------------
    UART0 receive buffer register //0x03a6
------------------------------------------------------*/
union st_u0rb {                        /*  UART0 receive buffer register     */
    struct {                        /*  Bit  Access                      */
     unsigned char             :1;        /*  Receive data                       */
     unsigned char            :1;        /*  Receive data                       */
     unsigned char            :1;        /*  Receive data                       */
     unsigned char            :1;        /*  Receive data                       */
     unsigned char            :1;        /*  Receive data                       */
     unsigned char            :1;        /*  Receive data                       */
     unsigned char            :1;        /*  Receive data                       */
     unsigned char            :1;        /*  Receive data                       */
     unsigned char          :1;        /*  Receive data                       */
     unsigned char          :1;        /* Nothing assigned                       */
     unsigned char          :1;        /* Nothing assigned                       */
      unsigned char  ABT_U0RB:1;     /* Arbitration lost detecting flag    */
      unsigned char  OER_U0RB:1;     /* Overrun error flag                 */
      unsigned char  FER_U0RB:1;     /* Framing error flag                */
      unsigned char  PER_U0RB:1;     /* Parity error flag                 */
      unsigned char  SUM_U0RB:1;     /* Error sum flag                     */
    }BIT;
    struct{
     unsigned char U0RBL;            /* Low  8 bit                         */
     unsigned char U0RBH;           /* High 8 bit                         */
    }BYTE;
    unsigned short  WORD;
};

