RT-Thread/rt-thread/bsp/m16c62p/drivers/iom16c62p.h
/*------------------------------------------------------
    UART1 transmit/receive mode register //0x03a8
------------------------------------------------------*/
union st_u1mr {                    /* union U1MR                                   */
    struct {                        /* Bit  Access                               */
     unsigned char     SMD0_U1MR  :1; /* Serial I/O mode select bit             */
     unsigned char    SMD1_U1MR  :1; /* Serial I/O mode select bit             */
     unsigned char    SMD2_U1MR  :1; /* Serial I/O mode select bit             */
     unsigned char    CKDIR_U1MR :1; /* Internal/external clock select bit     */
     unsigned char    STPS_U1MR  :1; /* Stop bit length select bit             */
     unsigned char    PRY_U1MR   :1; /* Odd/even parity select bit             */
     unsigned char    PRYE_U1MR  :1; /* Parity enable bit                         */
     unsigned char    IOPOL_U1MR :1; /* TxD,RxD I/O polarity reverse bit            */
    } BIT;                            /*                                               */
    unsigned char BYTE;           /* Byte Access                             */
};

/*------------------------------------------------------
    UART1 transmit buffer register //0x03aa
------------------------------------------------------*/
union st_u1tb {                 /* UART1 Transmit buffer register 16 bit ; Use "MOV" instruction when writing to this register. */
   struct{
    unsigned char U1TBL;     /* UART1 Transmit buffer register low  8 bit    */
    unsigned char U1TBH;     /* UART1 Transmit buffer register high 8 bit    */
   } BYTE;                     /* Byte access                                        */
   unsigned short   WORD;     /* Word Access                                        */
};

/*------------------------------------------------------
     UART1 transmit/receive control register 0 //0x03ac
------------------------------------------------------*/
union st_u1c0 {                  /* union UCR                                   */
    struct {                     /* Bit  Access                                   */
     unsigned char     CLK0 :1;     /* BRG count source select bit                 */
     unsigned char    CLK1 :1;     /* BRG count source select bit                 */
     unsigned char    CRS  :1;     /* CTS~/RTS~ function select bit             */
     unsigned char    TXEPT:1;     /* Transmit register empty flag             */
     unsigned char    CRD  :1;     /* CTS~/RTS~ disable bit                     */
     unsigned char    NCH  :1;     /* Data output select bit                     */
     unsigned char    CKPOL:1;     /* CLK polarity select bit                     */
     unsigned char    UFORM:1;     /* Transfer format select bit                 */
    } BIT;                        /*                                               */
    unsigned char BYTE;         /* Byte Access                                 */
};                                 /*UARTi transmit/receive control register 0 */

/*------------------------------------------------------
     UART1 transmit/receive control register 1 //0x03ad
------------------------------------------------------*/
union st_u1c1 {             /* union U1C1                                       */
    struct {                /* Bit  Access                                       */
     unsigned char     TE:1;     /* Transmit enable bit                             */
     unsigned char    TI:1;     /* Transmit buffer empty flag                     */
     unsigned char    RE:1;     /* Receive enable bit                             */
     unsigned char    RI:1;     /* Receive complete flag                         */
     unsigned char      :1;     /*                                              */
     unsigned char      :1;     /*                                              */
     unsigned char      :1;     /*                                              */
     unsigned char      :1;     /*                                              */
    } BIT;                    /*                                                   */
     unsigned char BYTE;    /* Byte Access                                     */
};                             /*UART1 transmit/receive control register 1     */

/*------------------------------------------------------
     UART1 receive buffer register //0x03ae
------------------------------------------------------*/
union st_u1rb {                        /* UART1 receive buffer register */
    struct {                        /*  Bit  Access */
     unsigned char             :1;        /*  Receive data                       */
     unsigned char            :1;        /*  Receive data                       */
     unsigned char            :1;        /*  Receive data                       */
     unsigned char            :1;        /*  Receive data                       */
     unsigned char            :1;        /*  Receive data                       */
     unsigned char            :1;        /*  Receive data                       */
     unsigned char            :1;        /*  Receive data                       */
     unsigned char            :1;        /*  Receive data                       */
     unsigned char          :1;        /*  Receive data                       */
     unsigned char          :1;        /* Nothing assigned                       */
     unsigned char          :1;        /* Nothing assigned                       */
      unsigned char  ABT_U1RB:1;     /* Arbitration lost detecting flag    */
      unsigned char  OER_U1RB:1;     /* Overrun error flag                 */
      unsigned char  FER_U1RB:1;     /* Framing error flag                */
      unsigned char  PER_U1RB:1;     /* Parity error flag                 */
      unsigned char  SUM_U1RB:1;     /* Error sum flag                     */
    }BIT;
    struct{
     unsigned char U1RBL;           /* Low  8 bit                         */
     unsigned char U1RBH;           /* High 8 bit                         */
    }BYTE;
    unsigned short  WORD;
};

