RT-Thread/rt-thread/bsp/m16c62p/drivers/iom16c62p.h
/*------------------------------------------------------
    UART transmit/receive control register 2 //0x03b0
------------------------------------------------------*/
union st_ucon {                  /* union UCON                               */
    struct {                     /* Bit  Access                                   */
     unsigned char     U0IRS :1;     /* UART0 transmit interrupt cause select bit*/
     unsigned char    U1IRS :1;     /* UART1 transmit interrupt cause select bit*/
     unsigned char    U0RRM :1;     /* UART0 continuous receive mode enable bit */
     unsigned char    U1RRM :1;     /* UART1 continuous receive mode enable bit */
     unsigned char    CLKMD0:1;     /* CLK/CLKS select bit 0                    */
     unsigned char    CLKMD1:1;     /* CLK/CLKS select bit 1                    */
     unsigned char    RCSP  :1;     /* Separate CTS~/RTS~ bit                   */
     unsigned char          :1;     /*                                             */
    } BIT;                        /*                                               */
    unsigned char BYTE;        /* Byte Access                                 */
};                                 /*UART transmit/receive control register 2  */

/*------------------------------------------------------
    DMA0 request cause select register //0x03b8
------------------------------------------------------*/
union st_dm0sl {              /*    DMAi request cause select registers            */
    struct{
     unsigned char    DSEL0:1;/* DMA request cause select bit                 */
     unsigned char    DSEL1:1;/* DMA request cause select bit                 */
     unsigned char    DSEL2:1;/* DMA request cause select bit                 */
     unsigned char    DSEL3:1;/* DMA request cause select bit                 */
     unsigned char         :1;
     unsigned char         :1;
     unsigned char    DMS  :1;/* DMA request cause expansion bit             */
     unsigned char    DSR  :1;/* Software DMA request bit                     */
    }BIT;
     unsigned char  BYTE;
};

/*------------------------------------------------------
    DMA1 request cause select register //0x03ba
------------------------------------------------------*/
union st_dm1sl {               /*    DMAi request cause select registers    */
    struct{
     unsigned char    DSEL0:1; /* DMA request cause select bit                 */
     unsigned char    DSEL1:1; /* DMA request cause select bit                 */
     unsigned char    DSEL2:1; /* DMA request cause select bit                 */
     unsigned char    DSEL3:1; /* DMA request cause select bit                 */
     unsigned char            :1;
     unsigned char           :1;
     unsigned char    DMS  :1; /* DMA request cause expansion bit             */
     unsigned char    DSR  :1; /* Software DMA request bit                     */
    }BIT;
    unsigned char  BYTE;
};

/*------------------------------------------------------
    CRC data register //0x03bc
------------------------------------------------------*/
union st_crcd {                 /* CRC data register 16 bit                      */
   struct{
    unsigned char CRCDL;     /* CRC data register low  8 bit                  */
    unsigned char CRCDH;     /* CRC data register high 8 bit                  */
   } BYTE;                     /* Byte access                                      */
   unsigned short   WORD;    /* Word Access                                      */
};

/*------------------------------------------------------
    A/D register 0 //0x03c0
------------------------------------------------------*/
union st_ad0 {                 /* A/D register 0 16 bit                         */
   struct{
    unsigned char AD0L;      /* A/D register 0 low  8 bit                     */
    unsigned char AD0H;      /* A/D register 0 high 8 bit                     */
   }BYTE;                     /* Byte access                                    */
   unsigned short   WORD;     /* Word Access                                    */
};

/*------------------------------------------------------
    A/D register 1 //0x03c2
------------------------------------------------------*/
 union st_ad1 {                 /* A/D register 1 16 bit                         */
   struct{
    unsigned char AD1L;      /* A/D register 1 low  8 bit                     */
    unsigned char AD1H;      /* A/D register 1 high 8 bit                     */
   } BYTE;                     /* Byte access                                    */
   unsigned short   WORD;     /* Word Access                                    */
};

/*------------------------------------------------------
    A/D register 2 //0x03c4
------------------------------------------------------*/
union st_ad2 {                 /* A/D register 2 16 bit                         */
  struct{
    unsigned char AD2L;      /* A/D register 2 low  8 bit                     */
    unsigned char AD2H;      /* A/D register 2 high 8 bit                     */
  } BYTE;                     /* Byte access                                    */
  unsigned short   WORD;     /* Word Access                                    */
};

/*------------------------------------------------------
    A/D register 3 //0x03c6
------------------------------------------------------*/
union st_ad3 {                 /* A/D register 3 16 bit                         */
  struct{
    unsigned char AD3L;      /* A/D register 3 low  8 bit                     */
    unsigned char AD3H;      /* A/D register 3 high 8 bit                     */
  } BYTE;                     /* Byte access                                    */
    unsigned short   WORD;     /* Word Access                                    */
};

/*------------------------------------------------------
    A/D register 4 //0x03c8
------------------------------------------------------*/
union st_ad4 {                 /* A/D register 4 16 bit                         */
  struct{
    unsigned char AD4L;      /* A/D register 4 low  8 bit                     */
    unsigned char AD4H;      /* A/D register 4 high 8 bit                     */
  } BYTE;                     /* Byte access                                       */
  unsigned short   WORD;     /* Word Access                                    */
};

