RT-Thread/rt-thread/bsp/m16c62p/drivers/iom16c62p.h
/*------------------------------------------------------
    A/D register 5 //0x03ca
------------------------------------------------------*/
union st_ad5 {                 /* A/D register 5 16 bit                         */
  struct{
    unsigned char AD5L;      /* A/D register 5 low  8 bit                     */
    unsigned char AD5H;      /* A/D register 5 high 8 bit                     */
  } BYTE;                     /* Byte access                                       */
    unsigned short   WORD;     /* Word Access                                       */
};

/*------------------------------------------------------
    A/D register 6 //0x03cc
------------------------------------------------------*/
union st_ad6 {                 /* A/D register 6 16 bit                         */
   struct{
    unsigned char AD6L;      /* A/D register 6 low  8 bit                     */
    unsigned char AD6H;      /* A/D register 6 high 8 bit                     */
   } BYTE;                     /* Byte access                                    */
   unsigned short   WORD;     /* Word Access                                    */
 };

/*------------------------------------------------------
    A/D register 7 //0x03ce
------------------------------------------------------*/
union st_ad7 {                 /* A/D register 7 16 bit                         */
   struct{
    unsigned char AD7L;      /* A/D register 7 low  8 bit                     */
    unsigned char AD7H;      /* A/D register 7 high 8 bit                     */
   } BYTE;                     /* Byte access                                    */
   unsigned short   WORD;     /* Word Access                                    */
 };

/*------------------------------------------------------
    A/D control register 2 //0x03d4
------------------------------------------------------*/
union st_adcon2 {                /* union ADCON2                        */
    struct {                    /*  Bit  Access                     */
     unsigned char     SMP     :1;        /* A/D conversion method select bit */
     unsigned char     ADGSEL0 :1;        /* Reserved bit (Always set to 0 )  */
     unsigned char     ADGSEL1 :1;        /* Reserved bit (Always set to 0 )  */
     unsigned char               :1;        /* Reserved bit (Always set to 0 )  */
     unsigned char     CKS2    :1;        /* Nothing Assigned.                */
     unsigned char               :1;        /* Nothing Assigned.                */
     unsigned char               :1;        /* Nothing Assigned.                */
     unsigned char               :1;        /* Nothing Assigned.                */
    } BIT;
    unsigned char   BYTE;        /*  Byte Access                     */
};

/*------------------------------------------------------
    A/D control register 0  //0x03d6
------------------------------------------------------*/
union st_adcon0 {                  /* union ADCON0                                   */
    struct {                     /* Bit  Access                                   */
     unsigned char     CH0 :1;     /* Analog input pin select bit                 */
     unsigned char    CH1 :1;     /* Analog input pin select bit                 */
     unsigned char    CH2 :1;     /* Analog input pin select bit                 */
     unsigned char    MD0 :1;     /* A/D operation mode select bit 0             */
     unsigned char    MD1 :1;     /* A/D operation mode select bit 0             */
     unsigned char    TRG :1;     /* Trigger select bit                         */
     unsigned char    ADST:1;     /* A/D conversion start flag                 */
     unsigned char    CKS0:1;     /* Frequency select bit 0                     */
    } BIT;                        /*                                               */
    unsigned char BYTE;         /* Byte Access                                 */
};                                 /*A/D control register 0                    */


/*------------------------------------------------------
   A/D control register 1 //0x03d7
------------------------------------------------------*/
union st_adcon1 {                  /* union ADCON1                                   */
    struct {                     /* Bit  Access                                   */
     unsigned char     SCAN0:1;     /* A/D sweep pin select bit                 */
     unsigned char    SCAN1:1;     /* A/D sweep pin select bit                 */
     unsigned char    MD2  :1;     /* A/D operation mode select bit 1             */
     unsigned char    BITS :1;     /* 8/10-bit mode select bit                 */
     unsigned char    CKS1 :1;     /* Frequency select bit 1                     */
     unsigned char    VCUT :1;     /* Vref connect bit                            */
     unsigned char    OPA0 :1;     /* External op-amp connection mode bit         */
     unsigned char    OPA1 :1;     /* External op-amp connection mode bit         */
    } BIT;                        /*                                               */
    unsigned char BYTE;         /* Byte Access                                 */
};                                 /*A-D control register 1                    */


/*------------------------------------------------------
    D/A control register //0x03dc
------------------------------------------------------*/
union st_dacon{               /* union DACON                               */
    struct {                    /* Bit  Access                            */
     unsigned char     DA0E :1;  /* D/A0 output enable bit                 */
     unsigned char    DA1E :1;  /* D/A1 output enable bit             */
     unsigned char         :1;  /* Nothing Assigned                     */
     unsigned char         :1;  /* Nothing Assigned                     */
     unsigned char         :1;  /* Nothing Assigned                     */
     unsigned char         :1;  /* Nothing Assigned                     */
     unsigned char          :1;  /* Nothing Assigned                     */
     unsigned char         :1;  /* Nothing Assigned                     */
    } BIT;                       /*                                       */
    unsigned char BYTE;       /* Byte Access                         */
};                            /* D/A control register                */

