RT-Thread/rt-thread/bsp/m16c62p/drivers/iom16c62p.h
/*------------------------------------------------------
    Port P14 control register //0x03de
------------------------------------------------------*/
union st_pc14{                /* union pc14                            */
    struct {                    /* Bit  Access                            */
     unsigned char     P140 :1;  /* Port P14_0 register */
     unsigned char    P141 :1;  /* Port P14_1 register */
     unsigned char         :1;  /* Nothing Assigned                     */
     unsigned char         :1;  /* Nothing Assigned                     */
     unsigned char    pd140:1;  /* Port P14_0 direction register */
     unsigned char    pd141:1;  /* Port P14_1 direction register */
     unsigned char          :1;  /* Nothing Assigned                     */
     unsigned char         :1;  /* Nothing Assigned                     */
    } BIT;                       /*                                       */
    unsigned char BYTE;       /* Byte Access                         */
};                            /* Port P14 control register                */

/*------------------------------------------------------
    Pull-up control register 3 //0x03df
------------------------------------------------------*/
union st_pur3{               /* union pur3                           */
    struct {                    /* Bit  Access                            */
     unsigned char     PU30:1;  /* P11_0 to P11_3 pull-up */
     unsigned char    PU31:1;  /* P11_4 to P11_7 pull-up */
     unsigned char    PU32:1;  /* P12_0 to P12_3 pull-up */
     unsigned char    PU33:1;  /* P12_4 to P12_7 pull-up */
     unsigned char    PU34:1;  /* P13_0 to P13_3 pull-up */
     unsigned char    PU35:1;  /* P13_4 to P13_7 pull-up */
     unsigned char    PU36:1;  /* P14_0,P14_1 pull-up */
     unsigned char    PU37:1;  /* P11 to P14 effective bit */
    } BIT;                       /*                                       */
    unsigned char BYTE;       /* Byte Access                         */
};                            /* Pull-up control register 3                */

/*------------------------------------------------------
    Port P0 register //0x03e0
------------------------------------------------------*/
union st_p0 {               /* union P0                               */
    struct {                /* Bit  Access                            */
     unsigned char     P0_0:1; /* Port P00 register                 */
     unsigned char    P0_1:1; /* Port P01 register                 */
     unsigned char    P0_2:1; /* Port P02 register                 */
     unsigned char    P0_3:1; /* Port P03 register                 */
     unsigned char    P0_4:1; /* Port P04 register                 */
     unsigned char    P0_5:1; /* Port P05 register                 */
     unsigned char    P0_6:1; /* Port P06 register                 */
     unsigned char    P0_7:1; /* Port P07 register                 */
    } BIT;                   /*                                    */
    unsigned char BYTE;     /*  Byte Access                     */
};                          /*                                     */

/*------------------------------------------------------
    Port P1 register //0x03e1
------------------------------------------------------*/
union st_p1 {              /* union P1                               */
    struct {                  /* Bit  Access                              */
     unsigned char     P1_0:1;/* Port P10 register                    */
     unsigned char    P1_1:1;/* Port P11 register                 */
     unsigned char    P1_2:1;/* Port P12 register                 */
     unsigned char    P1_3:1;/* Port P13 register                 */
     unsigned char    P1_4:1;/* Port P14 register                 */
     unsigned char    P1_5:1;/* Port P15 register                 */
     unsigned char    P1_6:1;/* Port P16 register                 */
     unsigned char    P1_7:1;/* Port P17 register                 */
    } BIT;                  /*                                    */
    unsigned char BYTE;    /*  Byte Access                         */
};                         /*                                     */

/*------------------------------------------------------
    Port P0 direction register //0x03e2
------------------------------------------------------*/
union st_pd0 {              /* union PD0                              */
    struct {                /* Bit  Access                                 */
     unsigned char     PD0_0:1;/* Port P00 direction register         */
     unsigned char    PD0_1:1;/* Port P01 direction register         */
     unsigned char    PD0_2:1;/* Port P02 direction register         */
     unsigned char    PD0_3:1;/* Port P03 direction register         */
     unsigned char    PD0_4:1;/* Port P04 direction register         */
     unsigned char    PD0_5:1;/* Port P05 direction register         */
     unsigned char    PD0_6:1;/* Port P06 direction register         */
     unsigned char    PD0_7:1;/* Port P07 direction register         */
    } BIT;                   /*                                       */
    unsigned char BYTE;     /*  Byte Access                        */
};                          /*                                        */


/*------------------------------------------------------
    Port P1 direction register //0x03e3
------------------------------------------------------*/
union st_pd1 {              /* union PD1                      */
    struct {                /* Bit  Access                         */
     unsigned char     PD1_0:1;/* Port P10 direction register */
     unsigned char    PD1_1:1;/* Port P11 direction register */
     unsigned char    PD1_2:1;/* Port P12 direction register */
     unsigned char    PD1_3:1;/* Port P13 direction register */
     unsigned char    PD1_4:1;/* Port P14 direction register */
     unsigned char    PD1_5:1;/* Port P15 direction register */
     unsigned char    PD1_6:1;/* Port P16 direction register */
     unsigned char    PD1_7:1;/* Port P17 direction register */
    } BIT;                   /*                               */
    unsigned char BYTE;     /*  Byte Access                */
};                          /*                                */

