RT-Thread/rt-thread/bsp/m16c62p/drivers/iom16c62p.h
/*------------------------------------------------------
    Port P2 register //0x03e4
------------------------------------------------------*/
union st_p2 {              /* union P2                           */
    struct {                  /* Bit  Access                          */
     unsigned char     P2_0:1;/* Port P20 register                */
     unsigned char    P2_1:1;/* Port P21 register             */
     unsigned char    P2_2:1;/* Port P22 register             */
     unsigned char    P2_3:1;/* Port P23 register             */
     unsigned char    P2_4:1;/* Port P24 register             */
     unsigned char    P2_5:1;/* Port P25 register             */
     unsigned char    P2_6:1;/* Port P26 register             */
     unsigned char    P2_7:1;/* Port P27 register             */
    } BIT;                    /*                                */
    unsigned char BYTE;    /*  Byte Access                        */
};                         /*                                 */

/*------------------------------------------------------
    Port P3 register //0x03e5
------------------------------------------------------*/
union st_p3 {              /* union P3                           */
    struct {                  /* Bit  Access                          */
     unsigned char     P3_0:1;/* Port P30 register                */
     unsigned char    P3_1:1;/* Port P31 register             */
     unsigned char    P3_2:1;/* Port P32 register             */
     unsigned char    P3_3:1;/* Port P33 register             */
     unsigned char    P3_4:1;/* Port P34 register             */
     unsigned char    P3_5:1;/* Port P35 register             */
     unsigned char    P3_6:1;/* Port P36 register             */
     unsigned char    P3_7:1;/* Port P37 register             */
    } BIT;                     /*                                */
    unsigned char BYTE;    /*  Byte Access                     */
};                         /*                                 */

/*------------------------------------------------------
    Port P2 direction register //0x03e6
------------------------------------------------------*/
union st_pd2 {              /* union PD2                      */
    struct {                   /* Bit  Access                         */
     unsigned char     PD2_0:1;/* Port P20 direction register */
     unsigned char    PD2_1:1;/* Port P21 direction register */
     unsigned char    PD2_2:1;/* Port P22 direction register */
     unsigned char    PD2_3:1;/* Port P23 direction register */
     unsigned char    PD2_4:1;/* Port P24 direction register */
     unsigned char    PD2_5:1;/* Port P25 direction register */
     unsigned char    PD2_6:1;/* Port P26 direction register */
     unsigned char    PD2_7:1;/* Port P27 direction register */
        } BIT;               /*                               */
    unsigned char BYTE;     /*  Byte Access                */
};                          /*                                */


/*------------------------------------------------------
    Port P3 direction register //0x03e7
------------------------------------------------------*/
union st_pd3 {              /* union PD3                      */
    struct {                   /* Bit  Access                         */
     unsigned char     PD3_0:1;/* Port P30 direction register */
     unsigned char    PD3_1:1;/* Port P31 direction register */
     unsigned char    PD3_2:1;/* Port P32 direction register */
     unsigned char    PD3_3:1;/* Port P33 direction register */
     unsigned char    PD3_4:1;/* Port P34 direction register */
     unsigned char    PD3_5:1;/* Port P35 direction register */
     unsigned char    PD3_6:1;/* Port P36 direction register */
     unsigned char    PD3_7:1;/* Port P37 direction register */
    } BIT;                   /*                               */
    unsigned char BYTE;     /*  Byte Access                */
};                          /*                                */

/*------------------------------------------------------
    Port P4 register //0x03e8
------------------------------------------------------*/
union st_p4 {              /* union P4                           */
    struct {                  /* Bit  Access                          */
     unsigned char     P4_0:1;/* Port P40 register                */
     unsigned char    P4_1:1;/* Port P41 register             */
     unsigned char    P4_2:1;/* Port P42 register             */
     unsigned char    P4_3:1;/* Port P43 register             */
     unsigned char    P4_4:1;/* Port P44 register             */
     unsigned char    P4_5:1;/* Port P45 register             */
     unsigned char    P4_6:1;/* Port P46 register             */
     unsigned char    P4_7:1;/* Port P47 register             */
    } BIT;                     /*                                */
    unsigned char BYTE;    /*  Byte Access                     */
};                         /*                                 */

/*------------------------------------------------------
    Port P5 register //0x03e9
------------------------------------------------------*/
union st_p5 {              /* union P5                           */
    struct {                  /* Bit  Access                          */
     unsigned char     P5_0:1;/* Port P50 register                */
     unsigned char    P5_1:1;/* Port P51 register             */
     unsigned char    P5_2:1;/* Port P52 register             */
     unsigned char    P5_3:1;/* Port P53 register             */
     unsigned char    P5_4:1;/* Port P54 register             */
     unsigned char    P5_5:1;/* Port P55 register             */
     unsigned char    P5_6:1;/* Port P56 register             */
     unsigned char    P5_7:1;/* Port P57 register             */
    } BIT;                  /*                                */
    unsigned char BYTE;    /*  Byte Access                     */
};                         /*                                 */


