RT-Thread/rt-thread/bsp/m16c62p/drivers/iom16c62p.h
/*------------------------------------------------------
    Port P9 register //0x03f1
------------------------------------------------------*/
union st_p9 {              /* union P9                           */
    struct {                  /* Bit  Access                          */
     unsigned char     P9_0:1;/* Port P90 register                */
     unsigned char     P9_1:1;/* Port P91 register             */
     unsigned char    P9_2:1;/* Port P92 register             */
     unsigned char    P9_3:1;/* Port P93 register             */
     unsigned char    P9_4:1;/* Port P94 register             */
     unsigned char    P9_5:1;/* Port P95 register             */
     unsigned char    P9_6:1;/* Port P96 register             */
     unsigned char    P9_7:1;/* Port P97 register             */
    } BIT;                     /*                                */
    unsigned char BYTE;    /*  Byte Access                     */
};                         /*                                 */

/*------------------------------------------------------
    Port P8 direction register //0x03f2
------------------------------------------------------*/
union st_pd8 {              /* union PD8                      */
    struct {                /* Bit  Access                         */
     unsigned char     PD8_0:1;/* Port P80 direction register */
     unsigned char    PD8_1:1;/* Port P81 direction register */
     unsigned char    PD8_2:1;/* Port P82 direction register */
     unsigned char    PD8_3:1;/* Port P83 direction register */
     unsigned char    PD8_4:1;/* Port P84 direction register */
     unsigned char         :1;/* Nothing assigned            */
     unsigned char    PD8_6:1;/* Port P86 direction register */
     unsigned char    PD8_7:1;/* Port P87 direction register */
    } BIT;                   /*                               */
    unsigned char BYTE;     /*  Byte Access                */
};                          /*                                */


/*------------------------------------------------------
    Port P9 direction register //0x03f3
------------------------------------------------------*/
union st_pd9 {              /* union PD9                      */
    struct {                /* Bit  Access                         */
     unsigned char     PD9_0:1;/* Port P90 direction register */
     unsigned char    PD9_1:1;/* Port P91 direction register */
     unsigned char    PD9_2:1;/* Port P92 direction register */
     unsigned char    PD9_3:1;/* Port P93 direction register */
     unsigned char    PD9_4:1;/* Port P94 direction register */
     unsigned char    PD9_5:1;/* Port P95 direction register */
     unsigned char    PD9_6:1;/* Port P96 direction register */
     unsigned char    PD9_7:1;/* Port P97 direction register */
    } BIT;                   /*                               */
    unsigned char BYTE;     /*  Byte Access                */
};                          /*                                */

/*------------------------------------------------------
    Port P10 register //0x03f4
------------------------------------------------------*/
union st_p10 {              /* union P10                                       */
    struct {                /* Bit  Access                                          */
     unsigned char     P10_0:1;/* Port P100 register                            */
     unsigned char    P10_1:1;/* Port P101 register                             */
     unsigned char    P10_2:1;/* Port P102 register                             */
     unsigned char    P10_3:1;/* Port P103 register                             */
     unsigned char    P10_4:1;/* Port P104 register                             */
     unsigned char    P10_5:1;/* Port P105 register                             */
     unsigned char    P10_6:1;/* Port P106 register                             */
     unsigned char    P10_7:1;/* Port P107 register                             */
    } BIT;                   /*                                                */
    unsigned char BYTE;     /*  Byte Access                                 */
};                          /*                                 */

/*------------------------------------------------------
    Port P11 register //0x03f5
------------------------------------------------------*/
union st_p11 {              /* union P11                                       */
    struct {                /* Bit  Access                                          */
     unsigned char     P11_0:1;/* Port P110 register                            */
     unsigned char    P11_1:1;/* Port P111 register                             */
     unsigned char    P11_2:1;/* Port P112 register                             */
     unsigned char    P11_3:1;/* Port P113 register                             */
     unsigned char    P11_4:1;/* Port P114 register                             */
     unsigned char    P11_5:1;/* Port P115 register                             */
     unsigned char    P11_6:1;/* Port P116 register                             */
     unsigned char    P11_7:1;/* Port P117 register                             */
    } BIT;                   /*                                                */
    unsigned char BYTE;     /*  Byte Access                                 */
};                          /*                                 */

/*------------------------------------------------------
    Port P10 direction register //0x03f6
------------------------------------------------------*/
union st_pd10 {              /* union PD10                                        */
    struct {                 /* Bit  Access                                       */
     unsigned char     PD10_0:1;/* Port P100 direction register                 */
     unsigned char    PD10_1:1;/* Port P101 direction register                 */
     unsigned char    PD10_2:1;/* Port P102 direction register                 */
     unsigned char    PD10_3:1;/* Port P103 direction register                 */
     unsigned char    PD10_4:1;/* Port P104 direction register                 */
     unsigned char    PD10_5:1;/* Port P105 direction register                 */
     unsigned char    PD10_6:1;/* Port P106 direction register                 */
     unsigned char    PD10_7:1;/* Port P107 direction register                 */
    } BIT;                    /*                                                 */
        char BYTE;           /*  Byte Access                                  */
};                           /*                                              */

