RT-Thread/rt-thread/bsp/m16c62p/drivers/iom16c62p.h
/*------------------------------------------------------
    Port P11 direction register //0x03f7
------------------------------------------------------*/
union st_pd11 {              /* union PD11                                        */
    struct {                 /* Bit  Access                                       */
     unsigned char     PD11_0:1;/* Port P110 direction register                 */
     unsigned char    PD11_1:1;/* Port P111 direction register                 */
     unsigned char    PD11_2:1;/* Port P112 direction register                 */
     unsigned char    PD11_3:1;/* Port P113 direction register                 */
     unsigned char    PD11_4:1;/* Port P114 direction register                 */
     unsigned char    PD11_5:1;/* Port P115 direction register                 */
     unsigned char    PD11_6:1;/* Port P116 direction register                 */
     unsigned char    PD11_7:1;/* Port P117 direction register                 */
    } BIT;                    /*                                                 */
        char BYTE;           /*  Byte Access                                  */
};                           /*                                              */

/*------------------------------------------------------
    Port P12 register //0x03f8
------------------------------------------------------*/
union st_p12 {              /* union P12                                       */
    struct {                /* Bit  Access                                          */
     unsigned char     P12_0:1;/* Port P120 register                            */
     unsigned char    P12_1:1;/* Port P121 register                             */
     unsigned char    P12_2:1;/* Port P122 register                             */
     unsigned char    P12_3:1;/* Port P123 register                             */
     unsigned char    P12_4:1;/* Port P124 register                             */
     unsigned char    P12_5:1;/* Port P125 register                             */
     unsigned char    P12_6:1;/* Port P126 register                             */
     unsigned char    P12_7:1;/* Port P127 register                             */
    } BIT;                   /*                                                */
    unsigned char BYTE;     /*  Byte Access                                 */
};                          /*                                 */

/*------------------------------------------------------
    Port P13 register //0x03f9
------------------------------------------------------*/
union st_p13 {              /* union P13                                       */
    struct {                /* Bit  Access                                          */
     unsigned char     P13_0:1;/* Port P130 register                            */
     unsigned char    P13_1:1;/* Port P131 register                             */
     unsigned char    P13_2:1;/* Port P132 register                             */
     unsigned char    P13_3:1;/* Port P133 register                             */
     unsigned char    P13_4:1;/* Port P134 register                             */
     unsigned char    P13_5:1;/* Port P135 register                             */
     unsigned char    P13_6:1;/* Port P136 register                             */
     unsigned char    P13_7:1;/* Port P137 register                             */
    } BIT;                   /*                                                */
    unsigned char BYTE;     /*  Byte Access                                 */
};                          /*                                 */

/*------------------------------------------------------
    Port P12 direction register //0x03fa
------------------------------------------------------*/
union st_pd12 {              /* union PD12                                        */
    struct {                 /* Bit  Access                                       */
     unsigned char     PD12_0:1;/* Port P120 direction register                 */
     unsigned char    PD12_1:1;/* Port P121 direction register                 */
     unsigned char    PD12_2:1;/* Port P122 direction register                 */
     unsigned char    PD12_3:1;/* Port P123 direction register                 */
     unsigned char    PD12_4:1;/* Port P124 direction register                 */
     unsigned char    PD12_5:1;/* Port P125 direction register                 */
     unsigned char    PD12_6:1;/* Port P126 direction register                 */
     unsigned char    PD12_7:1;/* Port P127 direction register                 */
    } BIT;                    /*                                                 */
        char BYTE;           /*  Byte Access                                  */
};                           /*                                              */

/*------------------------------------------------------
    Port P13 direction register //0x03fb
------------------------------------------------------*/
union st_pd13 {              /* union PD13                                        */
    struct {                 /* Bit  Access                                       */
     unsigned char     PD13_0:1;/* Port P130 direction register                 */
     unsigned char    PD13_1:1;/* Port P131 direction register                 */
     unsigned char    PD13_2:1;/* Port P132 direction register                 */
     unsigned char    PD13_3:1;/* Port P133 direction register                 */
     unsigned char    PD13_4:1;/* Port P134 direction register                 */
     unsigned char    PD13_5:1;/* Port P135 direction register                 */
     unsigned char    PD13_6:1;/* Port P136 direction register                 */
     unsigned char    PD13_7:1;/* Port P137 direction register                 */
    } BIT;                    /*                                                 */
        char BYTE;           /*  Byte Access                                  */
};                           /*                                              */

