RT-Thread/rt-thread/bsp/m16c62p/drivers/iom16c62p.h
/*------------------------------------------------------
    Pull-up control register 0 //0x03fc
------------------------------------------------------*/
union st_pur0 {            /* union PUR0                                          */
    struct {               /* Bit  Access                                             */
     unsigned char     PU00:1;/* P00 to P03 pull-up                               */
     unsigned char    PU01:1;/* P04 to P07 pull-up                               */
     unsigned char    PU02:1;/* P10 to P13 pull-up                               */
     unsigned char    PU03:1;/* P14 to P17 pull-up                               */
     unsigned char    PU04:1;/* P20 to P23 pull-up                               */
     unsigned char    PU05:1;/* P24 to P27 pull-up                               */
     unsigned char    PU06:1;/* P30 to P33 pull-up                               */
     unsigned char    PU07:1;/* P34 to P37 pull-up                               */
    } BIT;                  /*                                                   */
    unsigned char BYTE;    /*  Byte Access                                           */
};                         /*                                                    */

/*------------------------------------------------------
    Pull-up control register 1 //0x03fd
------------------------------------------------------*/
union st_pur1 {            /* union PUR1                                          */
    struct {                  /* Bit  Access                                             */
     unsigned char     PU10:1;/* P40 to P43 pull-up                                */
     unsigned char    PU11:1;/* P44 to P47 pull-up                                */
     unsigned char    PU12:1;/* P50 to P53 pull-up                                */
     unsigned char    PU13:1;/* P54 to P57 pull-up                                */
     unsigned char    PU14:1;/* P60 to P63 pull-up                                */
     unsigned char    PU15:1;/* P64 to P67 pull-up                                */
     unsigned char    PU16:1;/* P70 to P73 pull-up (Except P70,P71 ; P70,P71 -> N-channel open drain ports)*/
     unsigned char    PU17:1;/* P74 to P77 pull-up                                */
    } BIT;                  /*                                                   */
    unsigned char BYTE;    /*  Byte Access                                        */
};                         /*                                                    */

/*------------------------------------------------------
    Pull-up control register 2 //0x03fe
------------------------------------------------------*/
union st_pur2 {            /* union PUR2                                        */
    struct {                  /* Bit  Access                                           */
     unsigned char     PU20:1;/* P80 to P83 pull-up                              */
     unsigned char    PU21:1;/* P84 to P87 pull-up (Except P85)                */
     unsigned char    PU22:1;/* P90 to P93 pull-up                              */
     unsigned char    PU23:1;/* P94 to P97 pull-up                             */
     unsigned char    PU24:1;/* P100 to P103 pull-up                              */
     unsigned char    PU25:1;/* P104 to P107 pull-up                              */
     unsigned char        :1;/* Nothing assigned                                  */
     unsigned char        :1;/* Nothing assigned                                  */
    } BIT;                     /*                                                 */
    unsigned char BYTE;    /*  Byte Access                                         */
};                         /*                                                  */

/*------------------------------------------------------
    Port control register //0x03ff
------------------------------------------------------*/
union st_pcr {             /* union PCR2                                        */
    struct {                  /* Bit  Access                                           */
     unsigned char     PCR0:1;/* Port P1 control register                          */
     unsigned char        :1;/* Nothing assigned                                  */
     unsigned char        :1;/* Nothing assigned                                  */
     unsigned char        :1;/* Nothing assigned                                  */
     unsigned char        :1;/* Nothing assigned                                  */
     unsigned char        :1;/* Nothing assigned                                  */
     unsigned char        :1;/* Nothing assigned                                  */
     unsigned char        :1;/* Nothing assigned                                  */
    } BIT;                     /*                                                 */
    unsigned char BYTE;    /*  Byte Access                                         */
};                         /*                                                  */




/* Processor mode register 0 */
#define PM0   (*(volatile union st_pm0 *)(0x0004))

/* Processor mode register 1 */
#define PM1   (*(volatile union st_pm1 *)(0x0005))

/* System clock control register 0 */
#define CM0   (*(volatile union st_cm0 *)(0x0006))

/* System clock control register 1 */
#define CM1   (*(volatile union st_cm1 *)(0x0007))

/* Chip select control register */
#define CSR   (*(volatile union st_csr *)(0x0008))

/* Address match interrupt enable register */
#define AIER  (*(volatile union st_aier *)(0x0009))

/* Protect register */
#define PRCR  (*(volatile union st_prcr *)(0x000A))

/* Data bank register */
#define DBR  (*(volatile union st_dbr *)(0x000B))

/* Oscillation stop detection register */
#define CM2  (*(volatile union st_cm2 *)(0x000C))

/* Watchdog timer start register */
#define WDTS  (*(volatile char *)(0x000E))

/* Watchdog timer control register */
#define WDC  (*(volatile union st_wdc *)(0x000F))

