RT-Thread/rt-thread/bsp/m16c62p/drivers/iom16c62p.h
/* Address match interrupt register 0 */
#define RMAD0 (*(volatile union st_rmad0 *)(0x0010))

/* Address match interrupt register 1 */
#define RMAD1 (*(volatile union st_rmad1 *)(0x0014))

/* Voltage detection register 1 */
#define VCR1 (*(volatile union st_vcr1 *)(0x0019))

/* Voltage detection register 2 */
#define VCR2 (*(volatile union st_vcr2 *)(0x001A))

/* Chip select expansion control register */
#define CSE (*(volatile union st_cse *)(0x001B))

/* PLC control register 0 */
#define PLC0 (*(volatile union st_plc0 *)(0x001C))

/* Processor mode register 2 */
#define PM2 (*(volatile union st_pm2 *)(0x001E))

/* Power supply down detection register */
#define D4INT (*(volatile union st_d4int *)(0x001F))

/* DMA0 source pointer */
#define SAR0  (*(volatile union st_sar0 *)(0x0020))

/* DMA0 destination pointer */
#define DAR0  (*(volatile union st_dar0 *)(0x0024))

/* DMA0 transfer counter */
#define TCR0  (*(volatile union st_tcr0  *)(0x0028))

 /* DMA0 control register */
#define DM0CON (*(volatile union st_dm0con  *)(0x002C))

/* DMA1 source pointer */
#define SAR1  (*(volatile union st_sar1 *)(0x0030))

/* DMA1 destination pointer */
#define DAR1  (*(volatile union st_dar1 *)(0x0034))

 /* DMA1 transfer counter */
#define TCR1  (*(volatile union st_tcr1 *)(0x0038))

/* DMA1 control register */
#define DM1CON  (*(volatile union st_dm1con *)(0x003c))


/* INT3~ interrupt control register */
#define INT3IC  (*(volatile union st_icr *)(0x0044))

/* Timer B5 interrupt control register */
#define TB5IC  (*(volatile union st_icr1 *)(0x0045))

/* Timer B4 interrupt control register */
#define TB4IC (*(volatile union st_icr1 *)(0x0046))

/* Timer B3 interrupt control register */
#define TB3IC (*(volatile union st_icr1 *)(0x0047))

/* UART1 BUS collision detection interrupt control register */
#define U1BCNIC  (*(volatile union st_icr1 *)(0x0046))

/* UART0 BUS collision detection interrupt control register */
#define U0BCNIC  (*(volatile union st_icr1 *)(0x0047))

/* SI/O4 interrupt control register */
#define S4IC  (*(volatile union st_icr *)(0x0048))

/* SI/O3 interrupt control register */
#define S3IC  (*(volatile union st_icr *)(0x0049))

/* INT5~ interrupt control register */
#define INT5IC  (*(volatile union st_icr *)(0x0048))

/* INT4~ interrupt control register */
#define INT4IC  (*(volatile union st_icr *)(0x0049))

/* Bus collision detection interrupt control register */
#define BCNIC  (*(volatile union st_bcnic *)(0x004a))

/* DMA0 interrupt control register */
#define DM0IC  (*(volatile union st_dm0ic *)(0x004b))

/* DMA1 interrupt control register */
#define DM1IC  (*(volatile union st_icr1 *)(0x004c))

/* Key input interrupt control register */
#define KUPIC  (*(volatile union st_icr1 *)(0x004D))

/* A/D conversion interrupt control register */
#define ADIC  (*(volatile union st_icr1 *)(0x004E))

/* UART2 transmit interrupt control register */
#define S2TIC  (*(volatile union st_icr1 *)(0x004F))

/* UART2 receive interrupt control register */
#define S2RIC  (*(volatile union st_icr1 *)(0x0050))

/* UART0 transmit interrupt control register */
#define S0TIC  (*(volatile union st_icr1 *)(0x0051))

/* UART0 receive interrupt control register */
#define S0RIC  (*(volatile union st_icr1 *)(0x0052))

/* UART1 transmit interrupt control register */
#define S1TIC (*(volatile union st_icr1 *)(0x0053))

/* UART1 receive interrupt control register */
#define S1RIC  (*(volatile union st_icr1 *)(0x0054))

/* Timer A0 interrupt control register */
#define TA0IC  (*(volatile union st_icr1 *)(0x0055))

/* Timer A1 interrupt control register */
#define TA1IC  (*(volatile union st_icr1 *)(0x0056))

/* Timer A2 interrupt control register */
#define TA2IC (*(volatile union st_icr1 *)(0x0057))

/* Timer A3 interrupt control register */
#define TA3IC  (*(volatile union st_icr1 *)(0x0058))

/* Timer A4 interrupt control register */
#define TA4IC  (*(volatile union st_icr1 *)(0x0059))

/* Timer B0 interrupt control register */
#define TB0IC  (*(volatile union st_icr1 *)(0x005A))

/* Timer B1 interrupt control register */
#define TB1IC  (*(volatile union st_icr1 *)(0x005B))

/* Timer B2 interrupt control register */
#define TB2IC  (*(volatile union st_icr1 *)(0x005C))

/* INT0~ interrupt control register */
#define INT0IC (*(volatile union st_icr *)(0x005D))

/* INT1~ interrupt control register */
#define INT1IC  (*(volatile union st_icr *)(0x005E))

/* INT2~ interrupt control register */
#define INT2IC  (*(volatile union st_icr *)(0x005F))

/* Flash identification register */
#define FIDR  (*(volatile union st_fidr *)(0x01b4))

/* Flash memory control register 1 */
#define FMR1  (*(volatile union st_fmr1 *)(0x01b5))

/* Flash memory control register 0 */
#define FMR0  (*(volatile union st_fmr0 *)(0x01b7))

/* Address match interrupt register 2 */
#define RMAD2  (*(volatile union st_rmad2 *)(0x01b8))

/* Address match interrupt enable register 2 */
#define AIER2  (*(volatile union st_aier2 *)(0x01bb))

/* Address match interrupt register 3 */
#define RMAD3  (*(volatile union st_rmad3 *)(0x01bc))

/* Peripheral clock select register */
#define PCLKR  (*(volatile union st_pclkr *)(0x025e))

/* Timer B3,4,5 count start flag */
#define TBSR  (*(volatile union st_tbsr *)(0x0340))


/********************************************************
*   declare  SFR short                                  *
********************************************************/
/*--------------------------------------------------------
    Timer registers : Read and write data in 16-bit units.
--------------------------------------------------------*/

/* Timer A1-1 register */
#define TA1_1  (*(volatile unsigned short *)(0x0342))

/* Timer A2-1 register */
#define TA2_1  (*(volatile unsigned short *)(0x0344))

/* Timer A4-1 register */
#define TA4_1  (*(volatile unsigned short *)(0x0346))

/* Three-phase PWM control regester 0 */
#define INVC0  (*(volatile union st_invc0 *)(0x0348))

 /* Three-phase PWM control register 1 */
#define INVC1  (*(volatile union st_invc1 *)(0x0349))

/* Three-phase output buffer register 0 */
#define IDB0  (*(volatile union st_idb0 *)(0x034a))

/* Three-phase output buffer register 1 */
#define IDB1  (*(volatile union st_idb1 *)(0x034b))

